#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.goodnight_anomaly will be created
  + resource "aws_cloudwatch_log_metric_filter" "goodnight_anomaly" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/yama-dev-env-goodnight"
      + name           = "yama-dev-env-goodnight-notify"
      + pattern        = "{$.loglevel = \"WARNING\" || $.loglevel = \"ERROR\"}"

      + metric_transformation {
          + name      = "goodnight-notify"
          + namespace = "yama/dev-env/Lambda"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.goodnight_notify will be destroyed
  - resource "aws_cloudwatch_log_metric_filter" "goodnight_notify" {
      - id             = "yama-dev-env-goodnight-notify" -> null
      - log_group_name = "/aws/lambda/yama-dev-env-goodnight" -> null
      - name           = "yama-dev-env-goodnight-notify" -> null
      - pattern        = "{$.extra_data.notify = \"true\"}" -> null

      - metric_transformation {
          - name      = "goodnight-notify" -> null
          - namespace = "yama/dev-env/Lambda" -> null
          - value     = "1" -> null
        }
    }

  # aws_cloudwatch_metric_alarm.goodnight_anomaly will be created
  + resource "aws_cloudwatch_metric_alarm" "goodnight_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:521635626865:yama-dev-env",
        ]
      + alarm_description                     = "Alarm for goodnight lambda"
      + alarm_name                            = "yama-dev-env-goodnight-notify"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "goodnight-notify"
      + namespace                             = "yama/dev-env/Lambda"
      + period                                = 10
      + statistic                             = "SampleCount"
      + tags                                  = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-goodnight-notify"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.goodnight_notify will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "goodnight_notify" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ap-northeast-1:521635626865:yama-dev-env",
        ] -> null
      - alarm_description         = "Alarm for goodnight lambda" -> null
      - alarm_name                = "yama-dev-env-goodnight-notify" -> null
      - arn                       = "arn:aws:cloudwatch:ap-northeast-1:521635626865:alarm:yama-dev-env-goodnight-notify" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 1 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "yama-dev-env-goodnight-notify" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "goodnight-notify" -> null
      - namespace                 = "yama/dev-env/Lambda" -> null
      - ok_actions                = [] -> null
      - period                    = 10 -> null
      - statistic                 = "SampleCount" -> null
      - tags                      = {
          - "Author" = "yamaguti-dxa"
          - "Name"   = "yama-dev-env-goodnight-notify"
        } -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_lambda_function.goodnight will be updated in-place
  ~ resource "aws_lambda_function" "goodnight" {
        arn                            = "arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-goodnight"
        filename                       = "lambda/artifacts/goodnight.zip"
        function_name                  = "yama-dev-env-goodnight"
        handler                        = "main.lambda_handler"
        id                             = "yama-dev-env-goodnight"
        invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-goodnight/invocations"
      ~ last_modified                  = "2020-05-02T16:29:01.470+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-goodnight:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::521635626865:role/yama-dev-env-lambda-goodnight"
        runtime                        = "python3.6"
      ~ source_code_hash               = "N0Ua34JBeSr60s2/8mZ5M2nrf/pAdOTEOpqBp+FoqnY=" -> "tpNtwBNjTnOmMtT6CPr7EfylbAMlNy7VhjMWda4g1zU="
        source_code_size               = 711
        tags                           = {
            "Author" = "yamaguti-dxa"
            "Name"   = "yama-dev-env-goodnight"
        }
        timeout                        = 30
        version                        = "$LATEST"

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>

*Workflow: `dev-env.terraform.ci-pr`, Action: `hashicorpterraform-github-actions3`, Working Directory: `./dev-env/terraform`, Workspace: `default`*
